//
//  BLEHeader.h
//  MasterDemo
//
//  Created by 丁付德 on 15/6/25.
//  Copyright (c) 2015年 dfd. All rights reserved.
//

#ifndef aerocom_BLEHeader_h
#define aerocom_BLEHeader_h

//*************************************************************************************

//--------------------------------------   UUID(统一大写写)   --------------------------

//*************************************************************************************




// 花草， 杯垫，欢乐豆
#define ServerUUID                GGet(@"FF05", @"FF02", @"FF07")      // 主服务UUID


#define RW_DateTime_UUID          GGet(@"F202", @"F202", @"F703")      // 读写日期时间


#define R_RealData_UUID           GGet(@"F207", @"F709", @"F709")      // 


// 下面是全部的集合
#define Arr_R_UUID                @[ RW_DateTime_UUID, R_RealData_UUID ]


//*************************************************************************************

//--------------------------------------  设备名称   ----------------------------------

//*************************************************************************************


#define Filter_Name               GGet(@"PLANT-",   @"WATER-",      @"Looker-")
#define Filter_Other_Name         GGet(@"watcher-", @"Cupcare-",    @"Looker-")

#define dataInterval                                    1.2                // 时间间隔


//*************************************************************************************

//--------------------------------------    数据     ----------------------------------

//*************************************************************************************



#define DataFirst                                       0xF5

#define DataOOOO                                        0x00


#endif
